{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"input_dtype": "float32", "name": "convolution2d_19", "nb_row": 3, "subsample": [1, 1], "b_constraint": null, "init": "glorot_uniform", "nb_col": 3, "batch_input_shape": [null, 3, 300, 300], "dim_ordering": "th", "b_regularizer": null, "bias": true, "W_constraint": null, "trainable": true, "border_mode": "valid", "activity_regularizer": null, "nb_filter": 32, "activation": "linear", "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_31", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "name": "maxpooling2d_19", "trainable": true, "border_mode": "valid", "dim_ordering": "th"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_20", "nb_row": 3, "subsample": [1, 1], "b_constraint": null, "init": "glorot_uniform", "nb_col": 3, "dim_ordering": "th", "b_regularizer": null, "bias": true, "W_constraint": null, "trainable": true, "border_mode": "valid", "activity_regularizer": null, "nb_filter": 32, "activation": "linear", "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_32", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "name": "maxpooling2d_20", "trainable": true, "border_mode": "valid", "dim_ordering": "th"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_21", "nb_row": 3, "subsample": [1, 1], "b_constraint": null, "init": "glorot_uniform", "nb_col": 3, "dim_ordering": "th", "b_regularizer": null, "bias": true, "W_constraint": null, "trainable": true, "border_mode": "valid", "activity_regularizer": null, "nb_filter": 64, "activation": "linear", "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_33", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "name": "maxpooling2d_21", "trainable": true, "border_mode": "valid", "dim_ordering": "th"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_7"}}, {"class_name": "Dense", "config": {"name": "dense_13", "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "input_dim": 78400, "output_dim": 64, "b_regularizer": null, "bias": true, "trainable": true, "activity_regularizer": null, "activation": "linear", "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_34", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_7", "p": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_14", "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "input_dim": 64, "output_dim": 1, "b_regularizer": null, "bias": true, "trainable": true, "activity_regularizer": null, "activation": "linear", "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_35", "activation": "sigmoid"}}]}