{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Convolution2D", "config": {"border_mode": "valid", "batch_input_shape": [null, 3, 150, 150], "input_dtype": "float32", "activation": "linear", "nb_col": 3, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "nb_filter": 32, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "trainable": true, "dim_ordering": "th", "name": "convolution2d_19", "nb_row": 3, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_31"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "th", "name": "maxpooling2d_19"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "nb_col": 3, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "trainable": true, "b_constraint": null, "dim_ordering": "th", "nb_filter": 32, "W_constraint": null, "name": "convolution2d_20", "nb_row": 3, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_32"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "th", "name": "maxpooling2d_20"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "nb_col": 3, "subsample": [1, 1], "activity_regularizer": null, "bias": true, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "trainable": true, "b_constraint": null, "dim_ordering": "th", "nb_filter": 64, "W_constraint": null, "name": "convolution2d_21", "nb_row": 3, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_33"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "th", "name": "maxpooling2d_21"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_7"}}, {"class_name": "Dense", "config": {"output_dim": 64, "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "input_dim": 18496, "trainable": true, "W_constraint": null, "name": "dense_13", "bias": true, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_34"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_7", "p": 0.5}}, {"class_name": "Dense", "config": {"output_dim": 1, "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "input_dim": 64, "trainable": true, "W_constraint": null, "name": "dense_14", "bias": true, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_35"}}]}